update mkdocs e constitution
